---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadType.ApparentPowerDensity
source: html/cf56443e-b4d5-9fcf-9c44-a818249b9dca.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadType.ApparentPowerDensity Property

The apparent power density of area based load type.

## Syntax (C#)
```csharp
public double ApparentPowerDensity { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for value is not a number
 -or-
 When setting this property: The given value for value is not finite
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for value must be non-negative.